interface MicrophoneIconPropTypes {
  className?: string;
}

// 양방향 소통 페이지 하단의 녹음 버튼(RecordingButton)에 쓰는 마이크 아이콘.
const MicrophoneIcon = ({ className }: MicrophoneIconPropTypes) => (
  <svg
    viewBox="0 0 36 36"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
    className={className}
  >
    <path
      d="M17.8813 22.5C20.3713 22.5 22.3813 20.49 22.3813 18V9C22.3813 6.51 20.3713 4.5 17.8813 4.5C15.3913 4.5 13.3813 6.51 13.3813 9V18C13.3813 20.49 15.3913 22.5 17.8813 22.5ZM26.7463 18C26.0113 18 25.3963 18.54 25.2763 19.275C24.6613 22.8 21.5863 25.5 17.8813 25.5C14.1763 25.5 11.1013 22.8 10.4863 19.275C10.3663 18.54 9.75133 18 9.01633 18C8.10133 18 7.38133 18.81 7.51633 19.71C8.25133 24.21 11.8513 27.735 16.3813 28.38V31.5C16.3813 32.325 17.0563 33 17.8813 33C18.7063 33 19.3813 32.325 19.3813 31.5V28.38C23.9113 27.735 27.5113 24.21 28.2463 19.71C28.3963 18.81 27.6613 18 26.7463 18Z"
      fill="currentColor"
    />
  </svg>
);

export default MicrophoneIcon;
